       IDENTIFICATION DIVISION.
       PROGRAM-ID. HW01NB.
       AUTHOR.     NIKOLINA BEST.
       PROCEDURE DIVISION.
                   DisplayPrompt.
       DISPLAY "Nikolina Best completed the first program".
           STOP RUN.
       END PROGRAM.